music_app/app/views/bands/show.html.erb

SELECT "albums".* FROM "albums" WHERE "albums"."band_id" = ?  [["band_id", 1]]
---

  <% if @band.albums.length > 0 %>